/**
 *  ________ ___  ___  ________  ___  __            ___  _________
 * |\  _____\\  \|\  \|\   ____\|\  \|\  \         |\  \|\___   ___\     |
 * \ \  \__/\ \  \\\  \ \  \___|\ \  \/  /|_       \ \  \|___ \  \_|     |
 *  \ \   __\\ \  \\\  \ \  \    \ \   ___  \       \ \  \   \ \  \      |
 *   \ \  \_| \ \  \\\  \ \  \____\ \  \\ \  \       \ \  \   \ \  \     |
 *    \ \__\   \ \_______\ \_______\ \__\\ \__\       \ \__\   \ \__\   \|/
 *     \|__|    \|_______|\|_______|\|__| \|__|        \|__|    \|__|    v
 *
 * ________________________________________________________________
 * |                                                              |
 * |                       未成年限制登录提醒                     |
 * |                                                              |
 * |您使用的是未成年账号，仅周五、周六、周日及法定节假日晚上8:00- |
 * |9:00可以游戏！当前已被限制！                                  |
 * |                                                              |
 * |            --------------------------------------            |
 * |            |           下次可玩游戏时段         |            |
 * |            |                                    |            |
 * |            |         本周五晚上8:00-9:00        |            |
 * |            |____________________________________|            |
 * |                                                              |
 * |温馨提示：                                                    |
 * |1.如果身份信息有误，请点击》》申请修改《《                    |
 * |2.如果您身份信息已经变动，可点击》》刷新身份《《              |
 * |                ____________    ____________                  |
 * |                |          |    |          |                  |
 * |                | 更换账号 |    |   确定   |                  |
 * |                |__________|    |__________|                  |
 * |______________________________________________________________|
 */

const 网址 = location.href;

function 破解() {
    if (网址.includes("4399.com/flash")) {
        // 搞破坏 4399

        try {
            Object.defineProperty(window, "isLoadingAntiindulgence", {
                value: 0,
                writable: false,
            });
        } catch (e) {}
        try {
            Object.defineProperty(window, "isIniframe", {
                value: "", // 原来是Function, 这样做可以使防沉迷报错
                writable: false,
            });
        } catch (e) {}
        try {
            Object.defineProperty(window, "getBizid", {
                value: "", // 原来是Function, 这样做可以使防沉迷报错
                writable: false,
            });
        } catch (e) {}
    }

    if (window.play22 && 网址.includes("7k7k.com")) {
        // 7k7k获取游戏直链1
        try {
            window.play22.playLoading();
            window.play22.playLoading = () => {}; // 防止重复调用
            减料成功 = 1;
        } catch (err) {}
    }
}

破解();
setTimeout(破解, 3000);
addEventListener(
    "load",
    () => {
        破解();
        setTimeout(破解, 3000);
    },
    true
);

console.log("[防沉迷终结者] 脚本注入成功");
